# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True: print(f"{hello} {world}!")

#або
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana =apples*4
print ("яблук:", apples)
print ("бананів:", banana)

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

perimetery = storona_1 + storona_2 + storona_3 + storona_4
print("Периметр:", perimetery, "см")


#"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
#"""
# task 07
#У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
#Скільки всього дерев посадили в саду?

apple=4
peer=apple+5
plum=apple-2
sum_three=apple+peer+plum
print("Всього посадили дерев", sum_three)
print ("Яблук -", apple, "Груш -", peer, "Слив -", plum)

# task 08
#До обіда температура повітря була на 5 градусів вище нуля.
#Після обіду температура опустилася на 10 градусів.
#Надвечір потепліло на 4 градуси. Яка температура надвечір?

var_1=5
var_2=var_1-10
var_3=var_2+4
tempt="Температура"
print (tempt, "до обіда:", var_1)
print (tempt, "після обіду:", var_2)
print (tempt, "надвечір:", var_3)


# task 09
#"""
#Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
##Скількі сьогодні дітей у театральному гуртку?
#"""

boys=24
girls=boys//2
print ("Сьогодні у театральному гуртку ", boys-1 + girls-2, "дітей")


# task 10

#Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
#а третя - як половина вартості першої та другої разом.
#Скільки будуть коштувати усі книги, якщо купити по одному примірнику?

var1=8
var2=var1+2
var3=(var1+var2)//2
sum=var1+var2+var3
print("Перша книга -", var1, "грн")
print("Друга книга -", var2, "грн")
print("Третя книга -", var3, "грн")
print ("Всього 3 книги коштують -", sum,"грн")